
'''Исходные данные'''
A = [[7, -2, 0, 0, 0],
     [-3, -7, 4, 0, 0],
     [0, -2, 15, 5, 0],
     [0, 0, -2, -12, -8],
     [0, 0, 0, -3, -10],]
f = [65,
     23,
     1,
     -58,
     -8]

'''Прямой ход'''
alpha = [((-1) * A[0][1] / A[0][0])]
beta = [(f[0] / A[0][0])]

for i in range (1,4):
     alpha.append ((-1) * A[i][i+1] / (A[i][i] + alpha[i-1] * A[i][i-1]))
     beta.append ((f[i] - A[i][i-1] * beta[i-1]) / (A[i][i] + alpha[i-1] * A[i][i-1]))

'''Обратный ход'''
x = [(f[4] - A[4][3] * beta [3]) / (A[4][4] + A[4][3] * alpha[3])]

for j in range (4, 0, -1):
     x.insert(0, (alpha[j - 1] * x[0] + beta[j - 1]))

'''Ответ'''
print ('x =', x, 'T')
